jyunyikuo/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_adc.c
/**************************************************************************//**
 * @file     hal_adc.c
 * @brief    This file implements the ADC HAL functions.
 *
 * @version  V1.00
 * @date     2017-01-18
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#include "cmsis.h"
#include "hal_adc.h"
#include "hal_gdma.h"
#include "hal_pinmux.h"
#include "hal_cache.h"
//#include "hal_timer.h" // commented out unless hal_delay_us/hal_delay_ms is used here
#include "hal_gpio.h" // weide added to support use of hal_gpio_pull_ctrl() function

#include "hal_irq.h"

#include "rtl8735b_syson_type.h"
#include "rtl8735b_syson_s_type.h"

#include "hal_sys_ctrl.h"

#if defined(CONFIG_BUILD_NONSECURE)
#include "hal_sys_ctrl_nsc.h"
#endif

// Removed - Coverity reports that limits.h does not provide needed symbols.
/* #if defined ( __GNUC__ )
#include <limits.h>
#else
#include "__limits.h"
#endif */

#ifdef CONFIG_ADC_EN // weide changed 

uint8_t hp_adc_ch_pin_en_sts;

#if   defined ( __CC_ARM )                                            /* ARM Compiler 4/5 */
extern hal_adc_func_stubs_t Image$$_STUB_ADC$$Base;     // symbol from linker script
#define __rom_stubs_hal_adc Image$$_STUB_ADC$$Base
#elif defined (__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)       /* ARM Compiler 6 */
extern hal_adc_func_stubs_t Image$$_STUB_ADC$$Base;     // symbol from linker script
#define __rom_stubs_hal_adc Image$$_STUB_ADC$$Base
#elif defined ( __GNUC__ )
extern hal_adc_func_stubs_t __rom_stubs_hal_adc;     // symbol from linker script
#elif defined ( __ICCARM__ )
extern hal_adc_func_stubs_t __rom_stubs_hal_adc;     // symbol from linker script
#endif

//volatile uint8_t lp_adc_ch_pin_en_sts  = 0;
extern const hal_adc_func_stubs_t hal_adc_stubs;

/**
 * @addtogroup hs_hal_adc ADC
 * @{
 */

/** \brief Description of hal_adc_pin_init
 *
 *    hal_adc_pin_init is used for adc pinmux initialization and register.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:        Pointer to ADC control adaptor.
 *   \return hal_status_t:        hal_status_t.
 */
hal_status_t hal_adc_pin_init(hal_adc_adapter_t *phal_adc_adapter)
{
	uint8_t adc_ch_cnt;
	hal_status_t retv;

	for (adc_ch_cnt = 0; adc_ch_cnt < HP_ADC_CH_NO; adc_ch_cnt++) { // weide modified
		if (phal_adc_adapter->plft_dat.pin_en.w & ((uint32_t)0x01 << adc_ch_cnt)) {
			if ((hp_adc_ch_pin_en_sts & ((uint32_t)0x01 << adc_ch_cnt)) == 0) {

				if (adc_ch_cnt < 4) { // first 4 pins - pure ADC
					retv = hal_pinmux_register((hal_adc_stubs.hal_adc_pin_list[adc_ch_cnt]).pin_name, (PID_ADC0 + adc_ch_cnt));

				} else { // last 4 pins - share with comparator

					if ((hal_adc_stubs.hal_adc_pin_list[adc_ch_cnt]).pin_name == PIN_A0) {
						hal_pinmux_unregister(PIN_A0, PID_JTAG); // Unregister GPIO_A0 as JTAG/SWD
						hal_gpio_pull_ctrl(PIN_A0, 0); // Set GPIO_A0 to High-Z
						DBG_ADC_INFO("GPIO_A0: Unregister JTAG/SWD pinmux, set pull_ctrl = High-Z\r\n");
					}

					if ((hal_adc_stubs.hal_adc_pin_list[adc_ch_cnt]).pin_name == PIN_A1) {
						hal_pinmux_unregister(PIN_A1, PID_JTAG); // Unregister GPIO_A1 as JTAG/SWD
						hal_gpio_pull_ctrl(PIN_A1, 0); // Set GPIO_A1 to High-Z
						DBG_ADC_INFO("GPIO_A1: Unregister JTAG/SWD pinmux, set pull_ctrl = High-Z\r\n");
					}

					retv = hal_pinmux_register((hal_adc_stubs.hal_adc_pin_list[adc_ch_cnt]).pin_name, FUNC_COMP_ADC);
				}

				if (retv != HAL_OK) {
					DBG_ADC_ERR("retv post pwr down: %d\r\n", retv);
					return retv;
				}

				hp_adc_ch_pin_en_sts |= ((uint32_t)0x01 << adc_ch_cnt);
			} else {
				DBG_ADC_WARN("ch-%d pin has been enabled.\r\n", adc_ch_cnt);
				DBG_ADC_WARN("adc pin sts: %x\r\n", hp_adc_ch_pin_en_sts);
			}
		}
	}

	return HAL_OK;
}

/** \brief Description of hal_adc_pin_deinit
 *
 *    hal_adc_pin_deinit is used for adc pinmux un-initialization and un-register.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:       Pointer to ADC control adapter.
 *   \return hal_status_t:        hal_status_t.
 */
hal_status_t hal_adc_pin_deinit(hal_adc_adapter_t *phal_adc_adapter)
{
	uint8_t adc_ch_cnt;
	hal_status_t retv = HAL_OK;

	for (adc_ch_cnt = 0; adc_ch_cnt < HP_ADC_CH_NO; adc_ch_cnt++) {
		if (phal_adc_adapter->plft_dat.pin_en.w & ((uint32_t)0x01 << adc_ch_cnt)) {
			if ((hp_adc_ch_pin_en_sts & ((uint32_t)0x01 << adc_ch_cnt)) != 0) {
				if (adc_ch_cnt < 4) { // first 4 pins - pure ADC
					retv = hal_pinmux_unregister((hal_adc_stubs.hal_adc_pin_list[adc_ch_cnt]).pin_name, (PID_ADC0 + adc_ch_cnt));
				} else { // last 4 pins - share with comparator
					retv = hal_pinmux_unregister((hal_adc_stubs.hal_adc_pin_list[adc_ch_cnt]).pin_name, FUNC_COMP_ADC);
				}

				if (retv != HAL_OK) {
					return retv;
				}

				hp_adc_ch_pin_en_sts &= ~((uint32_t)0x01 << adc_ch_cnt);

			} else {
				DBG_ADC_WARN("ch-%d pin is NOT disabled.", adc_ch_cnt);
				DBG_ADC_WARN("since comparator is NOT disabled.");
				DBG_ADC_WARN("adc pin sts: %x\n", hp_adc_ch_pin_en_sts);
			}
		}
	}

	return HAL_OK;
}

/** \brief Description of hal_adc_reinit
 *
 *    hal_adc_reinit is used for adc RE-initialization, thus it excludes pinmux registration and pin power controls.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:      Pointer to ADC control adapter.
 *   \return void        Void.
 */
void hal_adc_reinit(hal_adc_adapter_t *phal_adc_adapter)
{

	DBG_ADC_INFO("hal_adc_reinit\r\n");

