jyunyikuo/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_adc.c
	*(hal_adc_stubs.phal_adc_irq_adpt) = phal_adc_adapter;

	hal_adc_reg_irq(phal_adc_adapter, (irq_handler_t) hal_adc_stubs.hal_adc_irq_handler);
	hal_irq_set_priority(ADC_IRQn, ADC_IRQPri);

	/* read calibration params */
	if (phal_adc_adapter->use_cali != 0) {
		DBG_ADC_INFO("read cali param\r\n");
		hal_adc_read_cali_param((uint16_t)HP_ADC_GAIN_DENO_ADDR, (uint8_t *)(&(hal_adc_stubs.hal_adc_cali_para->gain_deno)),
								sizeof(hal_adc_stubs.hal_adc_cali_para->gain_deno));
		DBG_ADC_INFO("gain deno: %x\r\n", hal_adc_stubs.hal_adc_cali_para->gain_deno);
		if ((uint16_t)hal_adc_stubs.hal_adc_cali_para->gain_deno == 0xFFFF) {
			DBG_ADC_ERR("Read gain deno failed\r\n");
			DBG_ADC_ERR("Not to use calibration.\r\n");
			phal_adc_adapter->use_cali = 0;
		}
		hal_adc_read_cali_param((uint16_t)HP_ADC_GAIN_MOLE_ADDR, (uint8_t *)(&(hal_adc_stubs.hal_adc_cali_para->gain_mole)),
								sizeof(hal_adc_stubs.hal_adc_cali_para->gain_mole));
		DBG_ADC_INFO("gain mole: %x\r\n", hal_adc_stubs.hal_adc_cali_para->gain_mole);
		if ((uint16_t)hal_adc_stubs.hal_adc_cali_para->gain_mole == 0xFFFF) {
			DBG_ADC_ERR("Read gain mole failed\r\n");
			DBG_ADC_ERR("Not to use calibration.\r\n");
			phal_adc_adapter->use_cali = 0;
		}

		hal_adc_read_cali_param((uint16_t)HP_ADC_OFFSET_DENO_ADDR, (uint8_t *)(&(hal_adc_stubs.hal_adc_cali_para->offset_deno)),
								sizeof(hal_adc_stubs.hal_adc_cali_para->offset_deno));
		DBG_ADC_INFO("offset deno: %x\r\n", hal_adc_stubs.hal_adc_cali_para->offset_deno);
		if ((uint16_t)hal_adc_stubs.hal_adc_cali_para->offset_deno == 0xFFFF) {
			DBG_ADC_ERR("Read offset deno failed\r\n");
			DBG_ADC_ERR("Not to use calibration.\r\n");
			phal_adc_adapter->use_cali = 0;
		}
		hal_adc_read_cali_param((uint16_t)HP_ADC_OFFSET_MOLE_ADDR, (uint8_t *)(&(hal_adc_stubs.hal_adc_cali_para->offset_mole)),
								sizeof(hal_adc_stubs.hal_adc_cali_para->offset_mole));
		DBG_ADC_INFO("offset mole: %x\r\n", hal_adc_stubs.hal_adc_cali_para->offset_mole);
		if ((uint32_t)hal_adc_stubs.hal_adc_cali_para->offset_mole == 0xFFFFFFFF) {
			DBG_ADC_ERR("Read offset mole failed\r\n");
			DBG_ADC_ERR("Not to use calibration.\r\n");
			phal_adc_adapter->use_cali = 0;
		}

		hal_adc_read_cali_param((uint16_t)HP_ADC_BATT_INTERNAL_R_ADDR, (uint8_t *)(&(hal_adc_stubs.hal_adc_cali_para->batt_internal_r)),
								sizeof(hal_adc_stubs.hal_adc_cali_para->batt_internal_r));
		DBG_ADC_INFO("batt internal R mole: %x\n", hal_adc_stubs.hal_adc_cali_para->batt_internal_r);
		if ((uint16_t)hal_adc_stubs.hal_adc_cali_para->batt_internal_r == 0xFFFF) {
			DBG_ADC_ERR("Read battery internal R failed\r\n");
			DBG_ADC_ERR("Not to use calibration.\r\n");
			phal_adc_adapter->use_cali = 0;
		}
	}

}

/** \brief Description of hal_adc_init
 *
 *    hal_adc_init is used for adc initialization including pinmux control.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:      Pointer to ADC control adapter.
 *   \return hal_status_t:        hal_status_t.
 */
hal_status_t hal_adc_init(hal_adc_adapter_t *phal_adc_adapter)
{
	hal_status_t retv;

	hal_sys_peripheral_en(ADC_SYS, ENABLE);

	/* Pinmux Initialization */
	retv = hal_adc_pin_init(phal_adc_adapter);
	if (retv != HAL_OK) {
		return retv;
	} else {
		return hal_adc_stubs.hal_adc_init(phal_adc_adapter);
	}
}

/** \brief Description of hal_adc_deinit
 *
 *    hal_adc_deinit is used for adc deinitialization including pinmux control.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:        Pointer to ADC control adapter.
 *   \return hal_status_t:        hal_status_t.
 */
hal_status_t hal_adc_deinit(hal_adc_adapter_t *phal_adc_adapter)
{
	hal_status_t retv;

	hal_sys_peripheral_en(ADC_SYS, DISABLE);

#if 1 // original code, try temp style for a while
	retv = hal_adc_stubs.hal_adc_deinit(phal_adc_adapter);
	if (retv != HAL_OK) {
		return retv;
	} else {
		retv = hal_adc_pin_deinit(phal_adc_adapter);
		if (retv != HAL_OK) {
			return retv;
		}

	}

	return HAL_OK;
#else

	retv = __rom_stubs_hal_adc.hal_adc_deinit(phal_adc_adapter);
	if (retv != HAL_OK) {
		return retv;
	}

	retv = hal_adc_pin_deinit(phal_adc_adapter);
	if (retv != HAL_OK) {
		return retv;
	}

	return retv;

#endif

}

/** \brief Description of hal_adc_dma_init
 *
 *    hal_adc_dma_init is to initialize DMA module for adc data collection.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:      Pointer to ADC control adapter.
 *   \param[in] hal_gdma_adaptor_t *padc_gdma_adaptor:            Pointer to GDMA channel control type.
 *
 *   \return hal_status_t:
 */
hal_status_t hal_adc_dma_init(hal_adc_adapter_t *phal_adc_adapter, hal_gdma_adaptor_t *padc_gdma_adaptor)
{
	DBG_ADC_INFO("dma init >>\n");
	if (padc_gdma_adaptor == NULL) {
		return HAL_ERR_PARA;
	}

	phal_adc_adapter->dma_dat.padaptor = padc_gdma_adaptor;
	padc_gdma_adaptor->busy = 0;
	padc_gdma_adaptor->have_chnl = 0;

	/* Allocate DMA channel first */
	if (phal_adc_adapter->dma_dat.ch_sts == ADCDmaChNone) {
		/* alloc a single block channel first */
		if (hal_gdma_chnl_alloc(padc_gdma_adaptor, MultiBlkDis) != HAL_OK) {
			DBG_ADC_ERR("dma channel alloc failed\n");
			return HAL_ERR_HW;
		}
		phal_adc_adapter->dma_dat.ch_sts = ADCDmaChGot;
		phal_adc_adapter->use_dma = ADCEnable;
	}

	if (phal_adc_adapter->dma_dat.ch_sts != ADCDmaChInitialed) {
		padc_gdma_adaptor->gdma_isr_type = (TransferType | ErrType);

		padc_gdma_adaptor->gdma_ctl.int_en = 1;
#ifdef ADC_DMA_PATCH
		padc_gdma_adaptor->gdma_ctl.src_msize   = MsizeOne;
		padc_gdma_adaptor->gdma_ctl.src_tr_width = TrWidthTwoBytes;
		padc_gdma_adaptor->gdma_ctl.dest_msize  = MsizeOne;
		padc_gdma_adaptor->gdma_ctl.dst_tr_width = TrWidthTwoBytes;
#else
		padc_gdma_adaptor->gdma_ctl.src_msize   = MsizeFour;
		padc_gdma_adaptor->gdma_ctl.src_tr_width = TrWidthTwoBytes;
		padc_gdma_adaptor->gdma_ctl.dest_msize  = MsizeFour;
		padc_gdma_adaptor->gdma_ctl.dst_tr_width = TrWidthTwoBytes;
#endif
		padc_gdma_adaptor->gdma_ctl.dinc        = IncType;
		padc_gdma_adaptor->gdma_ctl.sinc        = NoChange;
		padc_gdma_adaptor->gdma_ctl.tt_fc       = TTFCPeriToMem;

		padc_gdma_adaptor->gdma_cfg.src_per    = GDMA_HANDSHAKE_ADC;

		hal_gdma_handshake_init(padc_gdma_adaptor, padc_gdma_adaptor->gdma_cfg.src_per);
		hal_gdma_chnl_init(padc_gdma_adaptor);
		hal_gdma_irq_reg(padc_gdma_adaptor,
						 (irq_handler_t)(hal_adc_stubs.hal_adc_dma_irq_handler), (void *)phal_adc_adapter);
		phal_adc_adapter->dma_dat.ch_sts = ADCDmaChInitialed;

		/* assign default d-cache handling function */
		phal_adc_adapter->dcache_invalidate_by_addr = hal_cache_stubs.dcache_invalidate_by_addr;
		phal_adc_adapter->dcache_clean_invalidate_by_addr = hal_cache_stubs.dcache_clean_invalidate_by_addr;
	}

	DBG_ADC_INFO("dma init <<\n");
	return HAL_OK;
}

/** \brief Description of hal_adc_dma_deinit
 *
 *    hal_adc_dma_deinit is to deinitialize DMA module for adc data collection.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:      Pointer to ADC control adapter.
 *
 *   \return hal_status_t:
 */
hal_status_t hal_adc_dma_deinit(hal_adc_adapter_t *phal_adc_adapter)
{
	if (phal_adc_adapter->dma_dat.padaptor != NULL) {
		hal_gdma_chnl_free(phal_adc_adapter->dma_dat.padaptor);
	}

	/* remove default d-cache handling function */
	phal_adc_adapter->dcache_invalidate_by_addr = NULL;
	phal_adc_adapter->dcache_clean_invalidate_by_addr = NULL;

	phal_adc_adapter->use_dma = ADCDisable;
	phal_adc_adapter->dma_dat.ch_sts = ADCDmaChNone;
	return HAL_OK;
}

