jyunyikuo/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_adc.c
/** \brief Description of hal_adc_read_dma
 *
 *    hal_adc_read_dma is used to read data contiuously by using DMA module.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:          Pointer to ADC control adapter
 *   \param[in] uint32_t dat_len:                       ADC conversion data length.
 *   \param[in] uint16_t *dat_buf:                      ADC conversion data pointer.
 *   \param[in] uint8_t trigger_source:                 Inform ADC the trigger source.
 *                                                  1: automatic, 2: timer, 3: comparator,
 *                                                  software trigger is not available when using DMA because
 *                                                  software trigger would occupy CPU resource and application could
 *                                                  not get any performance improvement even using DMA.
 *
 *   \return hal_status_t:
 */
hal_status_t hal_adc_read_dma(hal_adc_adapter_t *phal_adc_adapter, uint32_t dat_len, uint16_t *dat_buf,
							  uint8_t trigger_source)
{
	ADC_TypeDef *padc_reg = phal_adc_adapter->init_dat.reg_base;

	volatile uint32_t gdma_idx;
	hal_status_t retv;
	uint8_t adc_dma_multi = 0;

	/* software trigger is not sugguested to use DMA */
	if (trigger_source == ADCSWTrigMod) {
		return HAL_ERR_PARA;
	}

	/* check ADC is in progress or not */
	if (phal_adc_adapter->status != ADCStatusIdle) {
		DBG_ADC_WARN("Hardware in NOT in idle state\n");
		if (phal_adc_adapter->status == ADCStatusCVing) {
			DBG_ADC_WARN("A conversion is in progress\n");
		}

		return HAL_NOT_READY;
	}

	if (dat_len > MAX_DMA_BLOCK_SIZE) {
		if (dat_len <= MAX_DMA_BLOCK_SIZE * MAX_MULTI_BLOCK_NUM) {
			// Need to use multiple block DMA
			if (phal_adc_adapter->dma_dat.padaptor->ch_num < 4) {
				// Current GDMA Channel didn't support multiple block DMA, re-allocate another one
				gdma_idx = phal_adc_adapter->dma_dat.padaptor->gdma_index;  // backup old GDMA index
				hal_gdma_chnl_free(phal_adc_adapter->dma_dat.padaptor);
				retv = hal_gdma_chnl_alloc(phal_adc_adapter->dma_dat.padaptor, MultiBlkEn);
				adc_dma_multi = 1;
				if (retv != HAL_OK) {
					phal_adc_adapter->dma_dat.ch_sts = ADCDmaChNone;
					//phal_adc_adapter->dma_dat.padaptor = NULL;
					DBG_ADC_ERR("hal_uart_dma_recv: Err: re-allocate multiple block DMA channel failed(%d)\r\n", retv);
					return retv;
				} else {
					DBG_ADC_INFO("hal_uart_dma_recv: re-allocate GDMA %u chnl %u\r\n",
								 phal_adc_adapter->dma_dat.padaptor->gdma_index, phal_adc_adapter->dma_dat.padaptor->ch_num);
					hal_gdma_chnl_init(phal_adc_adapter->dma_dat.padaptor);
				}

				// Update GDMA handshake bit and IRQ handler(since may use different GDMA HW)
				if (gdma_idx != phal_adc_adapter->dma_dat.padaptor->gdma_index) {
					// allocated to different GDMA HW, update the handshake bit
					hal_gdma_handshake_init(phal_adc_adapter->dma_dat.padaptor, phal_adc_adapter->dma_dat.padaptor->gdma_cfg.src_per);
					phal_adc_adapter->dma_dat.ch_sts = ADCDmaChInitialed;
				}

				hal_gdma_irq_reg((phal_adc_adapter->dma_dat.padaptor),
								 (irq_handler_t)(hal_adc_stubs.hal_adc_dma_irq_handler), (void *)phal_adc_adapter);
			}

		} else {
			DBG_ADC_ERR("hal_adc_dma: Err: RX Len(%lu) too big\n", dat_len);
			return HAL_ERR_PARA;
		}
	}

	//DBG_ADC_ERR("dat_len: %d\n", dat_len);
	dbg_printf("dat_len: %d\r\n", dat_len); // weide temp
	phal_adc_adapter->use_dma = ADCEnable;
	phal_adc_adapter->cv_dat_len = dat_len;
	phal_adc_adapter->cv_dat_buf = dat_buf;

	if (phal_adc_adapter->dma_dat.padaptor->gdma_ctl.src_tr_width == TrWidthFourBytes) {
		phal_adc_adapter->cv_dat_len = dat_len * 4;
	} else {
		phal_adc_adapter->cv_dat_len = dat_len * 2;
	}

	phal_adc_adapter->cv_dat_buf = dat_buf;

	phal_adc_adapter->status = ADCStatusCVing;

	phal_adc_adapter->dma_dat.padaptor->ch_sar = (uint32_t) & (padc_reg->ADC_DAT_GLOBAL);
	phal_adc_adapter->dma_dat.padaptor->ch_dar = (uint32_t)phal_adc_adapter->cv_dat_buf;
	phal_adc_adapter->dma_dat.padaptor->gdma_ctl.block_size = dat_len;

	/* deal with d-cache sync. (clean-invalidate) */
	if (is_dcache_enabled()) {
		if (phal_adc_adapter->dcache_clean_invalidate_by_addr != NULL) {
			phal_adc_adapter->dcache_clean_invalidate_by_addr((uint32_t *)phal_adc_adapter->cv_dat_buf, (int32_t)phal_adc_adapter->cv_dat_len);
		} else {
			DBG_ADC_WARN("D-Cache is enabled but clean_invalidate function is NOT available before GDMA starts.\n");
		}
	}

	if (adc_dma_multi) {
		hal_gdma_transfer_start((void *)phal_adc_adapter->dma_dat.padaptor, MultiBlkEn);
	} else {
		hal_gdma_transfer_start((void *)phal_adc_adapter->dma_dat.padaptor, MultiBlkDis);
	}

	hal_adc_reset_list(phal_adc_adapter);
	hal_adc_clear_fifo(phal_adc_adapter);

	padc_reg->ADC_INTR_STS = 0xFFFFFFFF; // clear interrupt status
	padc_reg->ADC_INTR_CTRL |= ADC_BIT_IT_FIFO_OVER_EN | ADC_BIT_IT_ERR_EN;

	padc_reg->ADC_DMA_CON &= ~(ADC_MASK_DMA_CON_LVL);
	padc_reg->ADC_DMA_CON |= (phal_adc_adapter->init_dat.dma_rq_lv) << ADC_SHIFT_DMA_CON_LVL;
	padc_reg->ADC_DMA_CON |= ADC_BIT_DMA_CON_EN;

	padc_reg->ADC_CONF &= ~(ADC_MASK_OP_MOD); // clear any op modes set previously

	if (trigger_source == ADCAutoMod) {
		phal_adc_adapter->init_dat.hw_mode = ADCAutoMod;
		padc_reg->ADC_CONF |= ADCAutoMod << ADC_SHIFT_OP_MOD;
		hal_adc_auto_chsw_ctrl(phal_adc_adapter, ADCEnable);
	} else if (trigger_source == ADCTmTrigMod) {
		phal_adc_adapter->init_dat.hw_mode = ADCTmTrigMod;
		padc_reg->ADC_CONF |= ADCTmTrigMod << ADC_SHIFT_OP_MOD;
	}

	return HAL_OK;
}

/** \brief Description of hal_adc_timeout_chk
 *
 *    hal_adc_timeout_chk is used to check if adc operation is timeout.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:    Pointer to ADC control adapter.
 *   \param[in] uint32_t start_cnt:                     Timer start count.
 *   \return uint8_t:                                   Timeout or not.\n
 *                                                      0: not time-out. 1: time-out.
 */
uint8_t hal_adc_timeout_chk(hal_adc_adapter_t *phal_adc_adapter, uint32_t start_cnt)
{
	return hal_adc_stubs.hal_adc_timeout_chk(phal_adc_adapter, start_cnt);
}

/** \brief Description of hal_adc_sw_cv_trig
 *
 *    hal_adc_sw_cv_trig is used to execute ADC software conversion trigger.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:          Pointer to ADC control adapter.
 *   \return void
 */
void hal_adc_sw_cv_trig(hal_adc_adapter_t *phal_adc_adapter)
{
	hal_adc_stubs.hal_adc_sw_cv_trig(phal_adc_adapter);
}

/** \brief Description of hal_adc_pure_init
 *
 *    hal_adc_pure_init is used to initialize ADC module.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:       Pointer to ADC control adapter.
 *   \return hal_status_t
 */
hal_status_t hal_adc_pure_init(hal_adc_adapter_t *phal_adc_adapter)
{
	return hal_adc_stubs.hal_adc_pure_init(phal_adc_adapter);
}

/** \brief Description of hal_adc_pure_deinit
 *
 *    hal_adc_pure_deinit is used to initialize ADC module.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:       Pointer to ADC control adapter.
 *   \return hal_status_t
 */
hal_status_t hal_adc_pure_deinit(hal_adc_adapter_t *phal_adc_adapter)
{
	return hal_adc_stubs.hal_adc_pure_deinit(phal_adc_adapter);
}

/** \brief Description of hal_adc_set_in_type
 *
 *    hal_adc_set_in_type is used to set ADC channel input type.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:      Pointer to ADC control adapter.
 *   \param[in] uint8_t ch_no:                      ADC channel number.
 *   \param[in] uint8_t input_type:                 Input type.
 *   \return hal_status_t:          return HAL_OK when the given parameters is correct.
 *                                  Only ch0~ch5 are capable of two input type (single-end and differential)
 */
hal_status_t hal_adc_set_in_type(hal_adc_adapter_t *phal_adc_adapter, uint8_t ch_no, uint8_t input_type)
{
	return hal_adc_stubs.hal_adc_set_in_type(phal_adc_adapter, ch_no, input_type);
}

