jyunyikuo/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_adc.c
/** \brief Description of hal_adc_get_in_type
 *
 *    hal_adc_get_in_type is used to set ADC channel input type.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:        Pointer to ADC control adapter.
 *   \param[in] uint8_t ch_no:                              ADC channel number.
 *   \return uint8_t:                               channel input type.\n
 *                                                  0: single end, 1: differential.
 */
uint8_t hal_adc_get_in_type(hal_adc_adapter_t *phal_adc_adapter, uint8_t ch_no)
{
	return hal_adc_stubs.hal_adc_get_in_type(phal_adc_adapter, ch_no);
}

/** \brief Description of hal_adc_set_comp_thld
 *
 *    hal_adc_set_comp_thld is used to set ADC channel comparison threshold.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:      Pointer to ADC control adapter.
 *   \param[in] uint8_t ch_no:                      ADC channel number.
 *   \param[in] uint16_t thld_high:                 Comparison high threshold.
 *   \param[in] uint16_t thld_low:                  Comparison low threshold.
 *   \return hal_status_t
 */
hal_status_t hal_adc_set_comp_thld(hal_adc_adapter_t *phal_adc_adapter, uint8_t ch_no, uint16_t thld_high, uint16_t thld_low)
{
	return hal_adc_stubs.hal_adc_set_comp_thld(phal_adc_adapter, ch_no, thld_high, thld_low);
}

/** \brief Description of hal_adc_set_comp_rule
 *
 *    hal_adc_set_comp_rule is used to set ADC channel comparison control. When this is set to a particular
 *    criterion, the related comparison status and interrupt would be triggered.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:      Pointer to ADC control adapter.
 *   \param[in] uint8_t ch_no:                      ADC channel number.
 *   \param[in] uint8_t comp_rule:                  Comparison rule.
 *   \return hal_status_t
 */
hal_status_t hal_adc_set_comp_rule(hal_adc_adapter_t *phal_adc_adapter, uint8_t ch_no, uint8_t comp_rule)
{
	return hal_adc_stubs.hal_adc_set_comp_rule(phal_adc_adapter, ch_no, comp_rule);
}

/** \brief Description of hal_adc_clear_comp_intr_sts
 *
 *    hal_adc_clear_comp_intr_sts is used to clear adc comparison interrupt status.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:      Pointer to ADC control adapter.
 *   \param[in] uint8_t ch_no:                      ADC channel number.
 *   \return void
 */
void hal_adc_clear_comp_intr_sts(hal_adc_adapter_t *phal_adc_adapter, uint8_t ch_no)
{
	hal_adc_stubs.hal_adc_clear_comp_intr_sts(phal_adc_adapter, ch_no);
}

/** \brief Description of hal_adc_comp_intr_ctrl
 *
 *    hal_adc_comp_intr_ctrl is used to set ADC channel comparison control. When this is set to a particular
 *    criterion, the related comparison status and interrupt would be triggered.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:      Pointer to ADC control adapter.
 *   \param[in] uint8_t intr_option:                Interrupt option (source).\n
 *                                              0: cvlist end.          1: cv end.\n
 *                                              2: channel cv end.      3: fifo full.\n
 *                                              4: fifo over.           5: fifo empty.\n
 *                                              6: dat ovw.             7: err.
 *
 *   \param[in] uint8_t intr_enable:                Interrupt enable control.
 *   \return void
 */
void hal_adc_intr_ctrl(hal_adc_adapter_t *phal_adc_adapter, uint8_t intr_option, uint8_t intr_enable)
{
	hal_adc_stubs.hal_adc_intr_ctrl(phal_adc_adapter, intr_option, intr_enable);
}

/** \brief Description of hal_adc_clear_intr_sts
 *
 *    hal_adc_clear_intr_sts is used to clear adc interrupt interrupt status.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:      Pointer to ADC control adapter.
 *   \param[in] uint8_t intr_option:                Interrupt option (source).\n
 *                                              0: cvlist end.          1: cv end.\n
 *                                              2: channel cv end.      3: fifo full.\n
 *                                              4: fifo over.           5: fifo empty.\n
 *                                              6: dat ovw.             7: err.
 *   \return void
 */
void hal_adc_clear_intr_sts(hal_adc_adapter_t *phal_adc_adapter, uint8_t intr_option)
{
	hal_adc_stubs.hal_adc_clear_intr_sts(phal_adc_adapter, intr_option);
}

/** \brief Description of hal_adc_set_cvlist
 *
 *    hal_adc_set_cvlist is used to set ADC channel conversion list.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:      Pointer to ADC control adapter.
 *   \param[in] uint8_t *cvlist:                    Pointer to a channel conversion list. It should be an array start address.
 *   \param[in] uint8_t cvlist_len:                 Conversion list length.
 *   \return hal_status_t
 */
hal_status_t hal_adc_set_cvlist(hal_adc_adapter_t *phal_adc_adapter, uint8_t *cvlist, uint8_t cvlist_len)
{
	return hal_adc_stubs.hal_adc_set_cvlist(phal_adc_adapter, cvlist, cvlist_len);
}

/** \brief Description of hal_adc_item_to_ch
 *
 *    hal_adc_item_to_ch is used to transfer a list item to channel number.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:      Pointer to ADC control adapter.
 *   \param[in] uint8_t item_no:                    Item number in the hardware list register.
 *   \return uint8_t:                           Channel number of the list item.
 */
uint8_t hal_adc_item_to_ch(hal_adc_adapter_t *phal_adc_adapter, uint8_t item_no)
{
	return hal_adc_stubs.hal_adc_item_to_ch(phal_adc_adapter, item_no);
}

/** \brief Description of hal_adc_load_default
 *
 *    hal_adc_load_default is used to load default value for data structure.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:        Pointer to ADC control adaptor.
 *   \return void
 */
void hal_adc_load_default(hal_adc_adapter_t *phal_adc_adapter)
{
	hal_adc_stubs.hal_adc_load_default(phal_adc_adapter);
}


/** \brief Description of hal_adc_single_read
 *
 *    hal_adc_single_read is used for single for particular channel. \n
 *    This function would automatically execute software trigger flow and return the channel data.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:      Pointer to ADC control adaptor.
 *   \param[in] uint8_t ch_no:                      ADC channel number.
 *   \return uint16_t:            ADC sample data.
 */
uint16_t hal_adc_single_read(hal_adc_adapter_t *phal_adc_adapter, uint8_t ch_no)
{
	uint32_t reg_tmp;
	uint32_t count = 0;
	reg_tmp = hal_adc_stubs.hal_adc_single_read(phal_adc_adapter, ch_no);
	while (reg_tmp == 0xFFFF) {
		reg_tmp = hal_adc_stubs.hal_adc_single_read(phal_adc_adapter, ch_no);
		//hal_delay_ms(5);
		count++;
		if (count > 200) {
			DBG_ADC_WARN("Count is: %d\r\n", count); // weide
			break;
		}
	}
	return reg_tmp;
}

/** \brief Description of hal_adc_clear_fifo
 *
 *    hal_adc_clear_fifo is used to clear FIFO to the default state.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:          Pointer to ADC control adapter.
 *   \return void
 */
void hal_adc_clear_fifo(hal_adc_adapter_t *phal_adc_adapter)
{
	hal_adc_stubs.hal_adc_clear_fifo(phal_adc_adapter);
}

/** \brief Description of hal_adc_read_ch_dat
 *
 *    hal_adc_read_ch_dat is used to read the channel data directly without any trigger operation.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:          Pointer to ADC control adapter.
 *   \param[in] uint8_t ch_no:                          Channel number.
 *   \return uint16_t:                              channel conversion data.\n
 *                                                  If the data is NOT ready or overwritten, a value of 0xFFFF would\n
 *                                                  be returned.
 */

uint16_t hal_adc_read_ch_dat(hal_adc_adapter_t *phal_adc_adapter, uint8_t ch_no, uint8_t out_raw)
{
	return hal_adc_stubs.hal_adc_read_ch_dat(phal_adc_adapter, ch_no, out_raw);
}

