jyunyikuo/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/source/ram/hal_adc.c
/** \brief Description of hal_adc_read_continuous
 *
 *    hal_adc_read_continuous is used to read the channel data continuously according to cvlist and different
 *                                          trigger source.
 *
 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:          Pointer to ADC control adapter
 *   \param[in] uint32_t dat_len:                       ADC conversion data length.
 *   \param[in] uint16_t *dat_buf:                      ADC conversion data pointer.
 *   \param[in] uint8_t trigger_source:                 Inform ADC the trigger source.
 *                                                  0: software, 1: automatic, 2: timer
 *   \return hal_status_t.
 */
hal_status_t hal_adc_read_continuous(hal_adc_adapter_t *phal_adc_adapter, uint32_t dat_len, uint16_t *dat_buf,
									 uint8_t trigger_source)
{
	return hal_adc_stubs.hal_adc_read_continuous(phal_adc_adapter, dat_len, dat_buf, trigger_source);
}

/** \brief Description of hal_adc_reg_irq
 *
 *    hal_adc_reg_irq is used to register a irq handler

 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:        Pointer to ADC control adaptor.
 *   \param[in] irq_handler_t handler:                IRQ handler function.
 *   \return void
 */
void hal_adc_reg_irq(hal_adc_adapter_t *phal_adc_adapter, irq_handler_t handler)
{
	hal_adc_stubs.hal_adc_reg_irq(phal_adc_adapter, handler);
}

/** \brief Description of hal_adc_unreg_irq
 *
 *    hal_adc_unreg_irq is used to unregister a irq handler

 *   \param[in] hal_adc_adapter_t *phal_adc_adapter:        Pointer to ADC control adaptor.
 *   \return void
 */
void hal_adc_unreg_irq(hal_adc_adapter_t *phal_adc_adapter)
{
	hal_adc_stubs.hal_adc_unreg_irq(phal_adc_adapter);
}

/** \brief Description of hal_adc_cal_gain_deno_rtl8735b
 *
 *    hal_adc_cal_gain_deno_rtl8735b is used to calculate the denominator part of adc gain.
 *
 *   \param[in] int16_t real code 0
 *   \param[in] int16_t real code 1
 *   \return int16_t
 */
int16_t hal_adc_calc_gain_deno(int16_t real_co_0, int16_t real_co_1)
{
	return (int16_t)hal_adc_stubs.hal_adc_calc_gain_deno(real_co_0, real_co_1);
}

/** \brief Description of hal_adc_cal_gain_mole
 *
 *    hal_adc_cal_gain_mole_rtl8735b is used to calculate the molecular part (numerator) of adc gain.
 *
 *   \param[in] int16_t ideal code 0
 *   \param[in] int16_t ideal code 1
 *   \return int16_t
 */
int16_t hal_adc_calc_gain_mole(int16_t ideal_co_0, int16_t ideal_co_1)

{
	return (int16_t)hal_adc_stubs.hal_adc_calc_gain_mole(ideal_co_0, ideal_co_1);
}

/** \brief Description of hal_adc_cal_offet_deno
 *
 *    hal_adc_cal_offet_deno_rtl8735b is used to calculate denominator part of adc offset.
 *
 *   \param[in] int16_t real code 0
 *   \param[in] int16_t real code 1
 *   \return int16_t
 */
int16_t hal_adc_calc_offset_deno(int16_t real_co_0, int16_t real_co_1)
{
	return (int16_t)hal_adc_stubs.hal_adc_calc_offset_deno(real_co_0, real_co_1);
}

/** \brief Description of hal_adc_cal_offset_mole
 *
 *    hal_adc_cal_offset_mole_rtl8735b is used to calculate molecular part (numerator) of adc offset.
 *
 *   \param[in] int16_t ideal code 0
 *   \param[in] int16_t ideal code 1
 *   \param[in] int16_t real code 0
 *   \param[in] int16_t real code 1

 *   \return int32_t
 */
int32_t hal_adc_calc_offset_mole(int16_t ideal_co_0, int16_t ideal_co_1, int16_t real_co_0, int16_t real_co_1)
{
	return (int32_t)hal_adc_stubs.hal_adc_calc_offset_mole(ideal_co_0, ideal_co_1, real_co_0, real_co_1);
}

/** \brief Description of hal_adc_calc_cali_val
 *
 *    hal_adc_calc_cali_val_rtl8735b is used to calculate calibration value
 *
 *   \param[in] uint16_t adc real value
 *   \param[in] hal_adc_cali_para_t *phal_adc_cali_para
 *   \return int32_t
 */
uint32_t hal_adc_calc_cali_val(uint16_t adc_read_val, hal_adc_cali_para_t *phal_adc_cali_para)
{
	return (uint32_t)hal_adc_stubs.hal_adc_calc_cali_val(adc_read_val, phal_adc_cali_para);
}

/** \brief Description of hal_adc_read_cali_param
 *
 *    hal_adc_read_cali_param_rtl8735b is used to read calibration parameters.
 *
 *   \param[in] uint16_t parameters address
 *   \param[in] uint8_t *return data address
 *   \param[in] uint8_t parameter length
 *   \return void
 */
void hal_adc_read_cali_param(uint16_t addr, uint8_t *param_addr, uint8_t param_len)
{
	hal_adc_stubs.hal_adc_read_cali_param(addr, param_addr, param_len);
}

/** \brief Description of hal_adc_write_cali_param
 *
 *    hal_adc_write_cali_param_rtl8735b is used to write calibration parameters.
 *
 *   \param[in] uint16_t parameters address
 *   \param[in] uint8_t *data address
 *   \param[in] uint8_t parameter length
 *   \return void
 */
void hal_adc_write_cali_param(uint16_t addr, uint8_t *param_addr, uint8_t param_len)
{
	hal_adc_stubs.hal_adc_write_cali_param(addr, param_addr, param_len);
}
/** @} */ /* End of group hs_hal_adc */

#endif


